benchmark/old_outputs/single_thread/clock_new/zipf_128/2026-04-17T18:40:49-04:00_9_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 4056412
number of failed transactions: 0 (0.000%)
latency average = 0.089 ms
initial connection time = 2.901 ms
tps = 22535.954002 (without initial connection time)
SQL script 1: pgscripts/zipfian_select.sql
 - weight: 9 (targets 90.0% of total)
 - 3650067 transactions (90.0% of total)
 - number of transactions actually processed: 3650067 (tps = 20278.448544)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.069 ms
 - latency stddev = 0.014 ms
SQL script 2: pgscripts/zipfian_update.sql
 - weight: 1 (targets 10.0% of total)
 - 406345 transactions (10.0% of total)
 - number of transactions actually processed: 406345 (tps = 2257.505458)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.255 ms
 - latency stddev = 0.134 ms
ratio: .998380822518639